# Shared command-line environment for macOS and Linuxbrew.
# Keep machine-specific applications and credentials out of this file.

# Shell integration and interactive tools.
brew "antidote"
brew "fzf"
brew "starship"
brew "zoxide"

# GNU userland: the shell configuration intentionally uses these variants.
brew "coreutils"
brew "gawk"
brew "grep"
brew "gnu-sed"

# Language runtimes and version managers.
brew "fnm"
brew "go"
brew "node"
brew "pyenv"
brew "pyenv-virtualenv"
brew "uv"

# Editors.
brew "neovim"
brew "vim"

# Other command-line tools.
brew "bat"
brew "git"
brew "ripgrep"
brew "kubectl"
brew "ouch"
brew "tmux"
